In [1]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

import os

from env import get_connection

In [2]:
query = '''

SELECT bedroomcnt, bathroomcnt, calculatedfinishedsquarefeet, taxvaluedollarcnt, yearbuilt, taxamount, fips
FROM properties_2017
WHERE propertylandusetypeid = 261
;
'''

In [3]:
url = get_connection('zillow')

In [4]:
zillow = pd.read_sql(query,url)

In [ ]:
# rename column names
zillow = zillow.renmae(columns = {'bedroomcnt':'bed', 'bathroomcnt':'bath', 
                                  'calculatedfinishedsquarefeet': 'sqft', 'taxvaluedollarcnt': 'value', 
                                  'yearbuilt': 'year', 'taxamount':'tax'})

In [ ]:
# Change fips code to individual county code

In [5]:
zillow.shape

(2152863, 7)

In [6]:
zillow.isna().sum()

bedroomcnt                        11
bathroomcnt                       11
calculatedfinishedsquarefeet    8484
taxvaluedollarcnt                493
yearbuilt                       9337
taxamount                       4442
fips                               0
dtype: int64

In [7]:
# going to check the values of all the nulls and see if any values make sense

In [8]:
# all of the null bathroom are also null bedroom. Going ot drop these 11 columns. 
zillow[zillow.bedroomcnt.isna()]

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
107763,NaN,NaN,NaN,67366.0,1926.0,780.54,6059.0
118612,NaN,NaN,NaN,43992.0,1946.0,541.64,6059.0
193993,NaN,NaN,1348.0,840698.0,1952.0,NaN,6059.0
1141339,NaN,NaN,200.0,188972.0,NaN,NaN,6037.0
1324608,NaN,NaN,990.0,435000.0,1906.0,NaN,6037.0
1442975,NaN,NaN,NaN,273196.0,NaN,NaN,6037.0
1647346,NaN,NaN,400.0,28347.0,1954.0,NaN,6037.0
1701026,NaN,NaN,NaN,407930.0,1926.0,NaN,6037.0
1722707,NaN,NaN,NaN,477161.0,NaN,NaN,6037.0
1776422,NaN,NaN,NaN,38855.0,NaN,NaN,6037.0
1797985,NaN,NaN,NaN,1017957.0,1990.0,NaN,6037.0

In [9]:
# Dropping all null values
# Drops 12,628 observations
zillow = zillow.dropna()

In [9]:
zillow.shape

NameError: name 'zillow' is not defined

In [12]:
zillow.isna().sum()

bedroomcnt                      0
bathroomcnt                     0
calculatedfinishedsquarefeet    0
taxvaluedollarcnt               0
yearbuilt                       0
taxamount                       0
fips                            0
dtype: int64

In [22]:
zillow.fips.nunique()

3

In [ ]:
# next checking for spaces in data
# Does not apear ot be any blanck spaces
# Takes a long time to check

In [21]:
for col in zillow.columns:
    filtered_rows = zillow[zillow[col] == '']
    
    if not filtered_rows.empty:
        print(f"Rows with empty strings in column '{col}':")
        print(filtered_rows)
        print()
        print()

In [ ]:
# change data types.
# most int. Bathrooms can be floats.

In [ ]:
# When Data is clean go ahead and save to CSV
#

In [ ]:
# binning Data
import pandas as pd

# Sample data
df = pd.DataFrame({
    'age': [25, 42, 35, 50, 61]
})

# Define bins
bins = [20, 30, 40, 50, 100]

# Define labels for the bins
group_names = ['20-30', '30-40', '40-50', '50-100']

df['age_binned'] = pd.cut(df['age'], bins, labels=group_names)
print(df)

6037 == Los Angeles
6059 == Orange County
6111 == Ventura

In [7]:
# renames fips entries
# bins bed by capping at 7+
# bins bath by capping at 5+
## 1.75 beds grouped into 1.5
## 0.0 and 0.5 grouped into <1
# bins year by decade 

def bin_zil(df):
    
    # combines 1.75 into 1.5
    df['bath'] = df['bath'].replace(1.75,1.5)
    # bins baths 
    bins = [-float('inf'), 1, 1.5, 2, 2.5, 3, 3.5, 4, 4.5, 5, float('inf')]
    labels = ['<1', '1', '1.5', '2', '2.5', '3', '3.5', '4', '4.5', '5', '5.5+']
    
    
    # bath
    # bed = [0,1,2,3,4,5,6,>7]
    # bath = []
    # bed_name = []
    # df[]
    
    #replaces fips values
    county_rep = {6037:'Los Angeles',
                 6059:'Orange County',
                  6111:'Ventura'
                 }
    df['fips'] = df['fips'].replace(county_rep)

In [8]:
test = bin_zil(zillow)
test.head()

NameError: name 'zillow' is not defined